Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateCurtainGrid Property
 Can't create Curtain Wall Grid Line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateCurtainGrid { get; }
Public Shared ReadOnly Property CannotCreateCurtainGrid As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateCurtainGrid {
	FailureDefinitionId^ get ();
}
static member CannotCreateCurtainGrid : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace